package curriculum_B;

public class Qes4 {
	public static void main(String[] args) {
		/**********************************************************************************
		4,for文を使用して下記の通りに出力してください
		下記が見本
			-------------------------------------------------------------------------*/

		for (int i = 1; i < 10; i++) {
			for (int j = 1; j < 10; j++) {
				//printfを使い整える
				//%03dで幅2文字で表示
				System.out.printf("%02d * %02d = %02d" + "||", j, i, i * j); //%02dで幅2文字で表示
			}
			System.out.println(); //行ごとに改行し整える

		}
	}
}
